using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Ragnarok.Shogi
{
    /// <summary>
    /// 差し手文字列のサンプルを保持します。
    /// </summary>
    public static class SampleMove
    {
        /// <summary>
        /// 角換わり腰掛銀１号局
        /// 先手：久米可六
        /// 後手：天野宗歩
        /// </summary>
        public static readonly string RecliningSilver =
            "▲７六歩 △８四歩 ▲２六歩 △８五歩 ▲２五歩 △３二金" +
            "▲７七角 △３四歩 ▲８八銀 △７七角成 ▲同　銀 △２二銀" +
            "▲４八銀 △３三銀 ▲６八玉 △６二銀 ▲７八玉 △４二玉" +
            "▲５八金右 △６四歩 ▲５六歩 △６三銀 ▲５七銀 △５二金" +
            "▲６六歩 △５四銀 ▲６七金 △４四歩 ▲４六銀 △７四歩" +
            "▲５五歩 △４三銀 ▲６八金直 △３一玉 ▲３六歩 △９四歩" +
            "▲３五歩 △２二玉 ▲３四歩 △同銀右 ▲３五歩 △４三銀" +
            "▲５七銀 △９五歩 ▲５六銀 △１四歩 ▲４六歩 △１五歩" +
            "▲５七角 △７二角 ▲６五歩 △同　歩 ▲同　銀 △３六歩" +
            "▲３八飛 △１六歩 ▲４五歩 △同　角 ▲３四歩 △同銀右" +
            "▲５四歩 △６二飛 ▲６四歩 △７三桂 ▲６六銀 △６五桂" +
            "▲同　銀 △５五銀 ▲５六桂 △６六歩 ▲同　金 △６四銀" +
            "▲同　銀 △同　飛 ▲５五金 △６五飛 ▲４五金 △同　銀" +
            "▲６六銀 △５六銀 ▲６五銀 △５七銀成 ▲同　金 △４五桂" +
            "▲６七金 △６九銀 ▲７七玉 △３七歩成";

        /// <summary>
        /// 自陣角
        /// 先手：天野留次郎
        /// 後手：吉田多三郎
        /// </summary>
        public static readonly string MyTerritoryBishop =
            "▲２六歩 △８四歩 ▲２五歩 △８五歩 ▲７六歩 △３二金" +
            "▲７八金 △６二銀 ▲７七角 △５四歩 ▲２四歩 △同　歩" +
            "▲同　飛 △３四歩 ▲６八銀 △５三銀 ▲２八飛 △２三歩" +
            "▲２二角成 △同　銀 ▲７七銀 △６四銀 ▲６六歩 △４一玉" +
            "▲５八金 △５五歩 ▲６七金右 △３三銀 ▲４八銀 △７四歩" +
            "▲６五歩 △同　銀 ▲２七角 △５四角 ▲４九角 △７五歩" +
            "▲同　歩 △８六歩 ▲同　銀 △８八歩 ▲７七桂 △８九歩成" +
            "▲６六歩 △９九と ▲６五桂 △５一香 ▲７四歩 △８三飛" +
            "▲７三歩成 △同　桂 ▲７四銀 △７七歩 ▲６八金寄 △８一飛" +
            "▲７三桂不成△８七角成 ▲７七金寄 △８六飛 ▲同　金 △同　馬" +
            "▲８七歩 △６八馬 ▲同　玉 △７一金 ▲６三銀成 △７六歩" +
            "▲同　角 △７五金 ▲５三桂 △３一玉 ▲４三角成 △同　金" +
            "▲４一飛 △２二玉 ▲５一飛成 △６六金 ▲２一龍 △同　玉" +
            "▲２三飛成";

        /// <summary>
        /// 1983年アマチュア名人戦決勝
        /// 先手：藤森　保（東京）
        /// 後手：菱田正泰（三重）
        /// </summary>
        public static readonly string Normal3 =
            "▲７六歩 △８四歩 ▲７八飛 △８五歩 ▲７七角 △３四歩" +
            "▲６六歩 △６二銀 ▲６八銀 △４二玉 ▲４八玉 △３二玉" +
            "▲３八玉 △５四歩 ▲２八玉 △１四歩 ▲１六歩 △５三銀" +
            "▲５八金左 △４二銀上 ▲４六歩 △３五歩 ▲４七金 △３三銀" +
            "▲６七銀 △３四銀 ▲７五歩 △９四歩 ▲３八銀 △５二金右" +
            "▲５六歩 △２四歩 ▲５九角 △８四飛 ▲７六飛 △２五歩" +
            "▲７七桂 △３三角 ▲９六歩 △２二玉 ▲４八角 △３二金" +
            "▲７四歩 △同　歩 ▲６五歩 △８三飛 ▲７四飛 △７三飛" +
            "▲同飛成 △同　桂 ▲８二飛 △４二金右 ▲７四歩 △７七角成" +
            "▲７三歩成 △６七馬 ▲６三と △２六歩 ▲同　歩 △２五歩" +
            "▲同　歩 △６九飛 ▲３九金 △２六桂 ▲２七銀 △３九飛成" +
            "▲同　角 △４九馬 ▲３八桂 △同桂成 ▲同　銀 △３九馬" +
            "▲同　玉 △９三角 ▲７五歩 △８二角 ▲５三と △６九飛" +
            "▲４九桂 △５三金 ▲４一銀 △２七歩 ▲同　銀 △５八銀" +
            "▲４八金 △４九銀成 ▲同　金 △４七桂 ▲２八玉 △４九飛成" +
            "▲６六角 △４四歩 ▲７二飛 △４二金打 ▲３二銀成 △同　金" +
            "▲４二金 △５二桂 ▲４四角 △３三金打 ▲３二金 △同　玉" +
            "▲５三角成 △３九龍 ▲１七玉 △２八銀 ▲２六玉 △２五銀" +
            "▲同　玉 △３四金打 ▲２六玉 △２三玉 ▲５二飛成 △３七龍";

        /// <summary>
        /// 先手：土居市太郎七段
        /// 後手：阪田三吉八段
        /// </summary>
        public static readonly string Sample1 =
            "▲７六歩△３四歩▲２六歩△３二金▲２五歩△８八角成" +
            "▲同　銀△２二銀▲７七銀△４二玉▲４八銀△３三銀" +
            "▲７八金△６二銀▲６八玉△９四歩▲９六歩△６四歩" +
            "▲４六歩△６三銀▲４七銀△５四銀▲５六銀△３一玉" +
            "▲７九玉△２二玉▲８八玉△８四歩▲５八金△１四歩" +
            "▲１六歩△５二金▲３六歩△７四歩▲３七桂△４四歩" +
            "▲４五歩△同　歩▲２四歩△同　歩▲３五歩△４三金右" +
            "▲４一角△３五歩▲74角成△３六歩▲４五桂△３七歩成" +
            "▲３三桂成△同金直▲２六飛△９五歩▲４一馬△３二歩" +
            "▲３五銀△３四桂▲２九飛△３八角▲４四歩△４二金" +
            "▲同　馬△同　飛▲２四飛△同　金▲同　銀△２三歩" +
            "▲４五金△２五角▲５四金△同　歩▲４三銀△２四歩" +
            "▲４二銀成△９六歩▲９八歩△５八角成▲４一飛△９三飛" +
            "▲４三歩成△１二銀▲３一飛成△１三玉▲３二成銀△２三金" +
            "▲４五銀△５七馬▲５八歩△４六馬▲３四銀△２五歩" +
            "▲４五金";

        /// <summary>
        /// 棋戦：wdoor+floodgate-900-0
        /// 先手：co-danaka-kun
        /// 後手：bonanza6.0 core i7 980x@4GHz
        /// </summary>
        public static readonly string IriTama =
            "▲７六歩 △８四歩 ▲６八銀 △３四歩 ▲６六歩 △６二銀 ▲５六歩 △５四歩" +
            "▲４八銀 △４二銀 ▲５八金右 △３二金 ▲７八金 △４一玉 ▲６九玉 △５二金" +
            "▲７七銀 △３三銀 ▲７九角 △３一角 ▲３六歩 △４四歩 ▲６七金右 △７四歩" +
            "▲３五歩 △６四角 ▲１八飛 △７三角 ▲７五歩 △同　歩 ▲３四歩 △同　銀" +
            "▲７四歩 △６四角 ▲６五歩 △４二角 ▲３八飛 △４三金右 ▲４六角 △９二飛" +
            "▲７九玉 △３一玉 ▲８八玉 △２二玉 ▲５七銀 △７六歩 ▲６六銀左 △３五歩" +
            "▲７六金 △９四歩 ▲１六歩 △９五歩 ▲２八角 △１四歩 ▲７七金引 △７三歩" +
            "▲４六銀 △３六歩 ▲同　飛 △７四歩 ▲３五銀 △４五銀 ▲３九飛 △７三桂" +
            "▲６七金寄 △３四歩 ▲２六銀 △８五桂 ▲４六歩 △５六銀 ▲同　金 △９六歩" +
            "▲同　歩 △９七歩 ▲８六歩 △９六飛 ▲８七銀 △９八歩成 ▲同　香 △９七歩" +
            "▲９六銀 △９八歩成 ▲同　玉 △９六香 ▲８七玉 △４七銀 ▲５七歩 △５六銀成" +
            "▲同　歩 △７五香 ▲９六玉 △７八香成 ▲９五玉 △８九成香 ▲８四玉 △７七桂成" +
            "▲８三玉 △６七成桂 ▲９二玉 △６六成桂 ▲８五香 △６五成桂 ▲４五歩 △７五角" +
            "▲８九飛 △９三金 ▲９一玉 △５七角成 ▲４四歩 △同　金 ▲８二香成 △５六馬" +
            "▲９九飛 △９八歩 ▲同　飛 △２九馬 ▲３七角 △９四桂 ▲４五歩 △同　金" +
            "▲４一銀 △４二歩 ▲３二銀成 △同　玉 ▲６一飛 △５一金 ▲８一飛成 △４六銀" +
            "▲４八角 △５七銀打 ▲５九角 △４三玉 ▲７三歩 △６七桂 ▲７七角 △６六銀成" +
            "▲９九角 △１九馬 ▲６四歩 △８四金 ▲６三歩成 △９五香 ▲９六歩 △８六桂" +
            "▲５八飛 △６一歩 ▲６二と △同　金 ▲７二歩成 △９六香 ▲６六角 △同成桂" +
            "▲６二と △５七銀成 ▲８八飛 △９七角 ▲８七飛 △７六成桂 ▲９七飛 △同香成" +
            "▲６一龍 △４四玉 ▲７二と △９四飛 ▲９二金 △１八馬 ▲６四龍 △９二飛" +
            "▲同　玉 △３二金 ▲５三飛";

        /// <summary>
        /// 開始日時：2012/01/15 16:13:05
        /// 先手：あなた
        /// 後手：Bonanza
        /// </summary>
        public static readonly string YoneTama =
            "▲４八玉△３二飛▲６八銀△３四歩▲３八銀△６二玉" +
            "▲４六歩△７二玉▲５六歩△３五歩▲４七銀△４二銀" +
            "▲５七銀△８二玉▲２六歩△９二香▲３八金△９一玉" +
            "▲２五歩△３四飛▲２七金△８二銀▲３六歩△同　歩" +
            "▲同　金△１四歩▲３五歩△８四飛▲７八金△７一金" +
            "▲１六歩△５一金▲９六歩△６二金左▲３八飛△７二金寄" +
            "▲４五金△２四歩▲３四歩△２五歩▲２八飛△１三桂" +
            "▲１五歩△４四歩▲３五金△１五歩▲同　香△３三歩" +
            "▲１四歩△３四歩▲２四金△８五飛▲１三歩成△２六歩" +
            "▲５五桂△３一角▲２六飛△５四歩▲３二歩△５五歩" +
            "▲９七桂△６五飛▲６六銀△同　飛▲同　歩△１三角" +
            "▲同香成△５六歩▲同　銀△３五銀▲２五飛△２四銀" +
            "▲同　飛△１三香▲２二飛成△８九金▲７九角△同　金" +
            "▲同　金△１八香成▲１二飛△２九成香▲同　龍△５二香" +
            "▲５五歩△６四桂▲６五銀△５五香▲３七玉△５九角" +
            "▲３六玉△７七角成▲２五玉△６六馬▲６八香△９九馬" +
            "▲３四玉△５七香成▲３三銀△６八成香▲同　金△５五馬" +
            "▲４二銀成△６五馬▲２一龍△５六馬▲４五香△４六馬" +
            "▲４四玉△６八馬▲３三玉△７八馬▲３四銀△５六歩" +
            "▲４三香成△５七歩成▲１一飛成△４六歩▲６二歩△３一歩" +
            "▲同　龍△６二金寄▲４四角△７二金寄▲６二歩△５四金" +
            "▲６一歩成△４四金▲同成香△６一金▲同　龍△７一香" +
            "▲６二金△同　金▲同　龍△７二金▲同　龍△同　香" +
            "▲６二金△２九飛▲２五歩△７一香▲同　金△同　銀" +
            "▲同　龍△８二金▲６二金△９四歩▲９三金△３四馬" +
            "▲同　玉△２五飛成▲同　玉△６九角▲３四玉△７八角成" +
            "▲４五香△３三歩▲同　玉△４一桂▲同成銀△２二銀" +
            "▲同　玉△２一歩▲同　玉△１二銀▲３一玉△９三香" +
            "▲８二龍△同　玉▲７一銀";

        /// <summary>
        /// 開始日時：2012/02/19
        /// 先手：あなた
        /// 後手：Bonanza
        /// </summary>
        public static readonly string BonaTest =
            "▲７六歩△３四歩▲２六歩△８四歩▲６六歩△８五歩" +
            "▲７七角△６二銀▲２五歩△３三角▲７八金△３二金" +
            "▲５八金△４一玉▲６七金右△２二銀▲４八銀△３一玉" +
            "▲８八銀△６四歩▲６九玉△６三銀▲５六歩△７四歩" +
            "▲６八角△５二金▲７七銀△５一角▲７九玉△４四歩" +
            "▲８八玉△３三銀▲３六歩△４三金右▲３七銀△２二玉" +
            "▲４六銀△８四角▲３五歩△同　歩▲２四歩△同　銀" +
            "▲３五銀△同　銀▲同　角△７三角▲５五歩△３四歩" +
            "▲６八角△５四歩▲同　歩△同　銀▲４六歩△５五歩" +
            "▲３七桂△６五歩▲同　歩△８四角▲７五歩△３六銀" +
            "▲２五桂△７五歩▲４五歩△同銀上▲５三歩△同　金" +
            "▲４二歩△２五銀▲同　飛△７六桂▲同　銀△同　歩" +
            "▲４一銀△１四銀▲３二銀成△同　玉▲２六飛△６九銀" +
            "▲７六飛△７八銀成▲同　玉△７五金▲４一銀△３三玉" +
            "▲７五飛△同　角▲６六銀△８六歩▲７五銀△８七歩成" +
            "▲６九玉△６六歩▲同　金△３九飛▲５九歩△７七歩" +
            "▲３二金△４三玉▲６一角△５四玉▲４六桂△同　銀" +
            "▲同　角△６三桂▲５八玉△９八と▲８四歩△９九と" +
            "▲６四歩△３八飛成▲４八金△５六香▲同　金△同　歩" +
            "▲３八金△５五桂▲３四角成△３七歩▲６九香△６八歩" +
            "▲同　香△６七歩▲同　香△５七金▲同　角△６七桂成" +
            "▲同　玉△５七歩成▲同　玉△５五香▲６六玉△５七角" +
            "▲７六玉△７五角成▲同　玉△６四金▲７六玉△７二飛" +
            "▲８七玉△８六歩▲９六玉△９五銀▲同　玉△９四歩" +
            "▲８六玉△７五金▲７七玉△８五金▲６八玉△６二飛" +
            "▲６七桂△８四金▲４三角△６四玉▲６五飛△７三玉" +
            "▲６二飛成△同　玉▲６一角成△７三玉▲７二飛△８三玉" +
            "▲７一飛成△９二玉▲９三銀△同　玉▲８二銀△９二玉" +
            "▲８一龍";

        /// <summary>
        /// 開始日時：2011/07/25 14:43:58
        /// 先手：あなた
        /// 後手：Bonanza
        /// </summary>
        public static readonly string Tsume =
            "▲７六歩△３四歩▲２六歩△４四歩▲４八銀△４二銀" +
            "▲５六歩△５二飛▲６八玉△６二玉▲７八玉△７二玉" +
            "▲５八金右△４三銀▲９六歩△９四歩▲８六歩△８二玉" +
            "▲８七玉△３五歩▲２五歩△３三角▲７八銀△３二飛" +
            "▲５七銀△４二角▲４六銀△５二金左  ▲７九角△３四銀" +
            "▲１六歩△５四歩▲２六飛△４五歩▲５七銀△７二銀" +
            "▲８八角△３三桂▲２四歩△２二飛▲２三歩成  △同　飛" +
            "▲同飛成△同　銀▲２一飛△２七飛▲１七桂△２九飛成" +
            "▲３六歩△８四歩▲７七角△１九龍▲２三飛成  △１七龍" +
            "▲３三角成  △同　角▲同　龍△８五歩▲同　歩△８六歩" +
            "▲同　玉△８八角▲６六桂△９九角成  ▲８四歩△１六龍" +
            "▲３一龍△５一香▲４四角△６二桂▲１一角成  △８三歩" +
            "▲９七玉△９五歩▲７四桂△同　桂▲９九馬△９六歩" +
            "▲８八玉△９七歩成  ▲同　桂△８六香▲７九玉△９七香成" +
            "▲６八玉△８四歩▲４四馬△８八香成  ▲８九香△７八成香" +
            "▲同　金△１九龍▲５九香△９八銀▲８八香△９六桂" +
            "▲９四銀△８八成香  ▲同　金△同桂成▲同　馬△６五桂" +
            "▲８三歩△同　銀▲同銀成△同　玉▲７五桂△７二玉" +
            "▲９四角△６二玉▲４四馬△５三金打  ▲同　馬△同　玉" +
            "▲３三龍△４三角▲４四銀△６二玉▲５三金△７一玉" +
            "▲６一角成  △同　玉▲６二金打  △同　金▲同　金△同　玉" +
            "▲４二龍△５二金▲５三銀成△７一玉▲５一龍△同　金" +
            "▲７二香△同　玉▲６三成銀△７一玉▲７二金";

        /// <summary>
        /// 開始日時：2011/07/25 14:43:58
        /// 先手：あなた
        /// 後手：Bonanza
        /// </summary>
        public static readonly string Tsume2 =
            "▲７六歩△８四歩▲６八銀△３四歩▲７七銀△６二銀" +
            "▲２六歩△４二銀▲２五歩△３三銀▲４八銀△３二金" +
            "▲５六歩△５二金▲５七銀△５四歩▲４六銀△３一角" +
            "▲５五歩△５三銀▲６六銀△５五歩▲５八飛△４一玉" +
            "▲７八金△４四銀右▲３六歩△８五歩▲６九玉△８六歩" +
            "▲同　歩△同　角▲８七歩△４二角▲１六歩△３一玉" +
            "▲１五歩△６四歩▲４八金△６三金▲５五銀右△７四歩" +
            "▲５四歩△５五銀▲同　銀△６五銀▲３七桂△７六銀" +
            "▲８六銀△５六歩▲４五桂△６五銀▲３五歩△８五歩" +
            "▲同　銀△同　飛▲７七桂△８二飛▲６五桂△同　歩" +
            "▲５三歩成△同　金▲３四歩△５七桂▲同　金△８六歩" +
            "▲同　歩△５七歩成▲同　飛△８七歩▲同　金△４八銀" +
            "▲５六飛△５七金▲７六飛△３四銀▲７四飛△４五銀" +
            "▲７一飛成△５一歩▲８二龍△７五桂▲４六銀△５二金" +
            "▲５七銀△同銀成▲６一飛△６八銀▲７八玉△６七成銀" +
            "▲８九玉△６六成銀▲５二龍△８七桂成▲４一金△２二玉" +
            "▲６六角△同　歩▲３一銀△同　金▲４二龍△３二金打" +
            "▲３三銀△同　桂▲３二龍△同　金▲２一金△同　玉" +
            "▲３一金打△同　金▲同　金△同　玉▲５一飛成△４一角" +
            "▲５三角△２二玉▲１四桂△同　歩▲２一金△１二玉" +
            "▲１一金△同　玉▲４一龍△２一金▲１三香△１二桂" +
            "▲同香成△同　玉▲２四桂△同　歩▲２三角△同　玉" +
            "▲２一龍△２二金▲２四歩△同　玉▲２二龍△２三歩" +
            "▲３五金";

        /// <summary>
        /// 開始日時：2013/06/22 10:00
        /// 先手：リスナー全員
        /// 後手：西尾　明六段
        /// </summary>
        public static readonly string ChoKaigi =
            "▲７六歩△８四歩▲６八銀△３四歩▲６六歩△６二銀" +
            "▲５六歩△５四歩▲４八銀△４二銀▲５八金右△３二金" +
            "▲７八金△４一玉▲６九玉△５二金▲７七銀△７四歩" +
            "▲６七金右△６四歩▲７九角△７三桂▲２六歩△８五歩" +
            "▲２五歩△３三銀▲３六歩△６三銀▲３七銀△４四銀" +
            "▲２四歩△同　歩▲同　角△２三歩▲１五角△６五歩" +
            "▲同　歩△５五歩▲４六銀△５六歩▲同　金△５四銀" +
            "▲６四歩△５五歩▲６六金△６五桂▲６八銀△５三銀" +
            "▲２四歩△同　歩▲２三歩△３三角▲６五金△同　銀" +
            "▲４五桂△８六歩▲同　歩△５六歩▲３三桂不成△同　桂" +
            "▲２四角△２七歩▲同　飛△７六銀▲２二歩成△同　金" +
            "▲５五角△４四銀▲６三歩成△５五銀▲５二と△同　飛" +
            "▲５三歩△同　飛▲３五角△５二飛▲５三歩△８二飛" +
            "▲５五銀△２六歩▲同　飛△２五歩▲２三歩△３五歩" +
            "▲２二歩成△同　飛▲２三歩△２六歩▲５二金△３二玉" +
            "▲２二歩成△同　玉▲２四飛△２三桂▲４二金△３九飛" +
            "▲５九銀打△５七歩成▲同　銀△５八歩▲同　玉△５六歩" +
            "▲４八銀引△５七金▲６九玉△４八金";

        /// <summary>
        /// 長手数のサンプル。
        /// 
        /// 開始日時：1969/02/03
        /// 先手：芹沢博文
        /// 後手：原田泰夫
        /// </summary>
        public static readonly string LongSample =
            "▲７六歩△８四歩▲６八銀△３四歩▲７七銀△３五歩" +
            "▲５六歩△３二飛▲５八飛△６二玉▲４八金△７二銀" +
            "▲４九玉△７一玉▲５五歩△５二金左▲６六銀△４二銀" +
            "▲７七角△１四歩▲８六歩△６四歩▲８八飛△７四歩" +
            "▲８五歩△同　歩▲同　飛△８三歩▲８六飛△８二玉" +
            "▲７五歩△６三金▲７四歩△同　金▲７五歩△７三金" +
            "▲１六歩△３四飛▲３八玉△４四歩▲７六飛△４五歩" +
            "▲５八金上△１三角▲６八角△６三銀▲７七桂△４三銀" +
            "▲５七銀△３三桂▲６六歩△５二銀左▲６五歩△同　歩" +
            "▲５六銀△３六歩▲同　歩△６八角成▲同　金△５九角" +
            "▲５七金左△６八角成▲６五桂△７二金引▲５四歩△３七歩" +
            "▲同　桂△５四飛▲５五角△同　飛▲同　銀△８七角" +
            "▲６六飛△５七馬▲同　金△６四歩▲５三桂成△同　銀" +
            "▲３一飛△４三角成▲５四歩△同銀直▲同　銀△同　銀" +
            "▲８四歩△６五銀▲８六飛△８四歩▲８三歩△同　金" +
            "▲３二角△同　馬▲６一飛成△５四馬▲７一銀△９二玉" +
            "▲６三歩△７三金打▲８二歩△７二銀▲８一歩成△同　銀" +
            "▲６二歩成△６八角▲８七飛△２五桂打▲５二龍△７二歩" +
            "▲５八金△３七桂成▲同　玉△２五桂▲２八玉△９五角成" +
            "▲７四桂△８五歩▲９六歩△８四馬▲９五桂△９四歩" +
            "▲８三桂成△同　玉▲８二金△９三玉▲８一金△７五馬" +
            "▲７二と△同　馬▲８二銀不成△８四玉▲７二龍△同　金" +
            "▲７三銀打△同　金▲同銀不成△７四玉▲５二角△６三桂" +
            "▲８四金△同　馬▲同銀成△同　玉▲２五角成△７六銀打" +
            "▲８八飛△３八歩▲同　銀△３七歩▲同　玉△５七歩" +
            "▲８二金△７三銀▲８三金打△７五玉▲５七金△７七飛" +
            "▲７三金△５七飛成▲８三金引△６六銀▲８四銀△６五玉" +
            "▲７四角△５五玉▲５六歩△同　龍▲同　角△同　玉" +
            "▲４八桂△６五玉▲５六歩△５七銀不成▲６三金△７七角" +
            "▲４三馬△５四歩▲６四金△同　玉▲６一飛△６三歩" +
            "▲６五歩△同　銀▲６七桂△７四銀▲４二馬△５三桂" +
            "▲７三金△６五玉▲７四金△２五桂▲２六玉△４四角成" +
            "▲３五歩△４八銀不成▲同　飛△３四桂▲３六玉△５六玉" +
            "▲５八銀△６六玉▲６三飛成△７七玉▲５三馬△同　馬" +
            "▲同　龍△５九角▲４九飛△４八金▲７八歩△同　玉" +
            "▲６九銀打△８九玉▲７八角△９九玉▲４八飛△８八金" +
            "▲４九飛△８六角成▲７五銀△９七馬▲６八銀△８九金打" +
            "▲同　角△同　金▲５四龍△７八歩▲６九金△８七角" +
            "▲５七龍△５六歩▲６六龍△５七香▲５六龍△５八香成" +
            "▲同　龍△８八銀▲７七金△５七歩▲同　龍△７七銀成" +
            "▲同　銀△７九金打▲６八金△９五歩▲３四歩△９六歩" +
            "▲３三歩成△９八角成▲４八龍△８七馬寄▲２三と△９七歩成" +
            "▲２五玉△４三馬▲３四歩△８七と▲５五桂△４四馬" +
            "▲６六銀上△６五歩▲５六桂△６二馬▲７三歩△６六歩" +
            "▲６三桂成△５一馬▲５二歩△４一馬▲３三歩成△８八と" +
            "▲４四香△３一馬▲４二香成△７六馬▲２九飛△６七歩成" +
            "▲同　金△同　馬▲３一成香△５七歩▲４九銀△５六馬" +
            "▲６八桂△６七馬▲５六銀△５八歩成▲同　銀△６八馬" +
            "▲５七銀△７七馬▲４五銀△４四銀▲４六銀△３三銀" +
            "▲５七龍△１三桂▲同　と△２四金▲３六玉△４四桂" +
            "▲３七玉△３六歩▲同　銀△６七歩▲６六銀△６八馬" +
            "▲５三龍△３六桂▲３三龍△２五金▲５七銀左△２八銀" +
            "▲同　飛△同桂成▲同　玉△５八馬▲３八銀△６八歩成" +
            "▲４九銀打△６七馬▲４三角△５九と▲２五角成△４九と" +
            "▲３七玉△３九と▲２六玉△３八と▲同　龍△１三香" +
            "▲３四歩△２三歩▲３六桂△９八香成▲３三歩成△８六歩" +
            "▲６六金△７七馬▲２三と△６九飛▲１三と△６五銀" +
            "▲同　金△同飛成▲６四成桂△６九龍▲２四桂△４四馬" +
            "▲３五銀△７七馬▲１四馬△１九龍▲３二桂成△４五銀" +
            "▲３六銀△５九馬▲４八銀△４九馬▲同　龍△同　龍" +
            "▲４五銀△４八龍▲１五玉△２九飛▲２六歩△３七銀" +
            "▲２四玉△２六銀不成▲４四銀右△３七龍▲２三玉△３五銀" +
            "▲２五歩△４四銀▲同　銀△３四銀▲１二玉△２五銀" +
            "▲２三馬△３四銀▲３三馬△３五銀▲２三歩△４四銀" +
            "▲同　馬△４七龍▲２二馬△１九飛成▲２一玉";
    }
}
