using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Ragnarok.Shogi.Kif.Tests
{
    internal static partial class SampleKif
    {
        public static readonly string CommentKif =
            "# --- Kifu for Windows (Pro) V6.62.1 棋譜ファイル ---\n" +
            "対局ID：3237\n" +
            "記録ID：\n" +
            "開始日時：2014/10/17 04:00\n" +
            "終了日時：2014/10/18 13:19\n" +
            "表題：竜王戦\n" +
            "棋戦：第２７期竜王戦七番勝負　第１局\n" +
            "持ち時間：各８時間\n" +
            "消費時間：133▲448△479\n" +
            "場所：アメリカ・ハワイ州「ハレクラニ」\n" +
            "図：投了\n" +
            "手合割：平手　　\n" +
            "先手：糸谷哲郎\n" +
            "後手：森内俊之\n" +
            "手数----指手---------消費時間--\n" +
            "*森内俊之竜王に糸谷哲郎七段が挑戦する第27期竜王戦（読売新聞主催）七番勝負第１局はアメリカ・ハワイ州「ハレクラニ」で10月16日午前９時（現地時間。日本時間では17日午前４時。以下は現地時間で時刻を記載する）に開始予定。タイトル初挑戦の糸谷の戦いぶりが注目される。\n" +
            "*立会人は谷川浩司九段、新聞解説は佐藤康光九段、記録係は石田直裕四段。観戦記は青島たつひこさん。現地大盤解説は野月浩貴七段、聞き手は井道千尋女流初段。持ち時間は各８時間。開幕局の本局は森内の振り歩先による振り駒で先後を決める。過去の対戦成績は森内２勝、糸谷１勝。\n" +
            "*８時50分ごろ、駒を並べ始める。大橋流で並べられ、石田四段が振り駒を行う。結果はと金が３枚。糸谷の先手に決まった。静かに対局室の緊張感が高まっていく。森内は目を閉じて、気息を整える。\n" +
            "*本局はニコニコ生放送によるライブストリーミング中継が行われる。１日目の解説は富岡英作八段、聞き手は山口恵梨子女流初段。２日目の解説は藤井猛九段、聞き手は飯野愛女流１級が担当する。\n" +
            "*（棋譜・コメント入力＝銀杏）\n" +
            "*［棋譜表示の＊はコメント付きの指し手。【】はブログやリンクのタイトル］\n" +
            "*【ニュース 速報 YOMIURI ONLINE(読売新聞)】\n" +
            "*http://www.yomiuri.co.jp/ \n" +
            "*【読売プレミアムの将棋ページ】\n" +
            "*http://premium.yomiuri.co.jp/pc/#!/list_CULTURE%255fGO%255fSHOGI \n" +
            "*【ニコニコ生放送・１日目】\n" +
            "*http://live.nicovideo.jp/watch/lv193643941 \n" +
            "*【ニコニコ生放送・２日目】\n" +
            "*http://live.nicovideo.jp/watch/lv193644195 \n" +
            "   1 ７六歩(77)   ( 0:00/00:00:00)\n" +
            "*立会人の谷川九段が「定刻になりました。第27期竜王戦七番勝負第１局を糸谷七段の先手で始めてください」と告げて対局が開始された。糸谷の初手は▲７六歩。\n" +
            "   2 ８四歩(83)   ( 0:00/00:00:00)\n" +
            "*森内は△８四歩。居飛車党の糸谷に作戦をゆだねた。ここで関係者が退席する。\n" +
            "   3 ２六歩(27)   ( 0:00/00:00:00)\n" +
            "*糸谷は対局室の空気が落ち着いてから▲２六歩と突いて、ペットボトルのキャップを開けた。得意の角換わりを目指すつもりだ。\n" +
            "   4 ３二金(41)   ( 0:00/00:00:00)\n" +
            "*◆森内 俊之（もりうち としゆき）竜王◆\n" +
            "*1970年10月10日生まれ、神奈川県横浜市出身。勝浦修九段門下。1987年、四段。2002年、九段。棋士番号は183。\n" +
            "*タイトル戦登場は25回。獲得は竜王２期、名人８期（十八世名人）、棋王１期、王将１期の計12期。棋戦優勝は12回。\n" +
            "   5 ７八金(69)   ( 0:00/00:00:00)\n" +
            "*◆糸谷 哲郎（いとだに てつろう）七段◆\n" +
            "*1988年10月５日生まれ、広島県広島市出身。森信雄七段門下。2006年、四段。2014年、七段。棋士番号は260。\n" +
            "*2006年、第37回新人王戦で優勝。\n" +
            "*今回が初めてのタイトル戦となる。\n" +
            "   6 ８五歩(84)   ( 0:00/00:00:00)\n" +
            "*森内の本年度成績は９勝15敗（0.375）。\n" +
            "*最近10局を見ると４勝６敗で、４連敗中。\n" +
            "*対局数ランキング７位。\n" +
            "*昨年度の成績は28勝12敗（0.700）。\n" +
            "*通算成績は858勝490敗（0.637）。\n" +
            "   7 ７七角(88)   ( 0:00/00:00:00)\n" +
            "*糸谷の本年度成績は16勝４敗（0.800）。\n" +
            "*最近10局は７勝３敗。\n" +
            "*勝率ランキング３位、勝数ランキング８位、対局数ランキング19位。\n" +
            "*昨年度の成績は26勝14敗（0.650）。\n" +
            "*通算成績は262勝114敗（0.697）。\n" +
            "*４連勝すると、通算勝率が７割になる。\n" +
            "   8 ３四歩(33)   ( 0:00/00:00:00)\n" +
            "*森内は前期七番勝負で当時の渡辺明竜王を４勝１敗で破って、竜王復位を果たした。渡辺竜王が用いた作戦を次局で使うスタイルで揺さぶった。40代の竜王は初。\n" +
            "   9 ８八銀(79)   ( 0:00/00:00:00)\n" +
            "*糸谷は初めてのタイトル挑戦。決勝トーナメントでは順に三浦弘行九段、屋敷伸之九段、行方尚史八段、羽生善治名人と一流棋士をなぎ倒した。文句なしの実績だ。\n" +
            "  10 ７七角成(22) ( 0:00/00:00:00)\n" +
            "*初王手。戦型は角換わりに。対局前日に棋士に話を聞いたところ、角換わりを予想する声が多かった。森内が糸谷の得意戦法を受けて立った形だ。\n" +
            "  11 同　銀(88)   ( 0:00/00:00:00)\n" +
            "*竜王戦は勢いのある若手が活躍しやすい棋戦といわれる。第１期から見ると、島朗六段、羽生善治六段、佐藤康光七段、藤井猛七段、渡辺明六段（いずれも番勝負登場時の肩書）という面々は、高勝率をあげつつ番勝負に登場して竜王位を獲得。一躍シンデレラボーイとなった。\n" +
            "*糸谷は本局までの本年度の勝率は８割。一番乗っている棋士が番勝負に出てきた。森内は早いうちに出鼻をくじきたい。\n" +
            "  12 ４二銀(31)   ( 0:00/00:00:00)\n" +
            "*二人の対戦成績は森内の２勝１敗だが、すべてテレビの早指し棋戦だった上に直近でも４年前の対局だった。今回の七番勝負を予想するためのデータとしてはあまり参考にならないだろう。\n" +
            "  13 ３八銀(39)   ( 0:00/00:00:00)\n" +
            "  14 ７二銀(71)   ( 0:00/00:00:00)\n" +
            "*竜王戦は今期で27期。前身棋戦の十段戦は26期、九段戦は12期。読売新聞がタイトル戦を主催するようになって65期目となる。タイトル戦以前からも棋戦を主催しており、1937年に阪田三吉翁が木村義雄八段や花田長太郎八段と対戦した「南禅寺の決戦」「天龍寺の決戦」はよく知られている。対局前々日の記者会見で、小田尚英専門委員は「スポンサーとして読売新聞は80年くらいかかわっている」と述べた。\n" +
            "  15 ５八金(49)   ( 0:00/00:00:00)\n" +
            "*おやっ？\n" +
            "*９時15分ごろに指されたこの手は非常に珍しい。手元の棋譜データベースになかった。定跡と同じ形に戻る可能性は高いが、糸谷はなにやら工夫しようとしている。森内は前傾姿勢になる。右金を動かしたので角打ちの隙は生じるが△３九角と打っても▲１八飛から▲４九玉と取りに行けば問題ない。\n" +
            "*関係者が控室に戻ってくる。佐藤九段が地元紙に掲載された竜王戦の記事を携帯電話のカメラで撮る。\n" +
            "*佐藤九段「そういえば、昨日写真を撮っているところを撮られてしまいまして」\n" +
            "*関係者「もう中継ブログにあがっていますよ」\n" +
            "*佐藤九段「えーっ！　……、別にいいんですけど」\n" +
            "*驚く佐藤九段であった。佐藤九段は第４局２日目にニコニコ生放送の解説を務める。本局のエピソードが語られるかもしれない。お楽しみに。\n" +
            "*【第27期竜王戦第４局２日目 ニコニコ生放送】\n" +
            "*http://live.nicovideo.jp/watch/lv193732410 \n" +
            "  16 ６四歩(63)   ( 0:00/00:00:00)\n" +
            "*９時22分ごろ、森内が△６四歩と突く。腰掛け銀や右玉を考えた手だ。\n" +
            "  17 ６八玉(59)   ( 0:00/00:00:00)\n" +
            "*【対局１日目の朝】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-5280.html \n" +
            "*【振り駒】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-d297.html \n" +
            "*【対局開始】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-75cb.html \n" +
            "  18 ６三銀(72)   ( 0:00/00:00:00)\n" +
            "*竜王戦の海外対局は1990年の第３期七番勝負第１局で初めて行われてからから今回で15回目となる。\n" +
            "*その第３期竜王戦第１局はドイツのフランクフルトで行われた。東西のドイツが統一されて間もないころのことだ。フランクフルトは見本市の街で、この年の「ブックフェア」のテーマ国が日本。書道や美術、文学などが紹介され、その一つとして読売新聞は「将棋の竜王戦対局」を出品した。このときの成功により、海外対局が定着することとなった。\n" +
            "*海外対局を行うにあたり、さまざまなエピソードがある。オーストラリアでの対局で記録係を務めた野月浩貴七段は、税関に止められ、駒を消毒するよう言われたという。必死の説得で燻蒸せずに済み、無事に対局が行われたとのこと。畳は実際に燻蒸したという。\n" +
            "  19 ７九玉(68)   ( 0:00/00:00:00)\n" +
            "*糸谷は棒銀や早繰り銀の含みを残しながら進めている。▲４六歩と突いた瞬間にそれらの可能性は消える。\n" +
            "*一般的に棒銀は腰掛け銀に強いとされる。ここまでの駒組みを見ると、森内は腰掛け銀模様だ。なので、糸谷が棒銀に出る可能性はある。\n" +
            "*森内の考慮中に９時30分。慎重に時間を使って指している。\n" +
            "  20 ３三銀(42)   ( 0:00/00:00:00)\n" +
            "*ハレクラニはハワイ語で『天国にふさわしい館』を意味する。ハレクラニのルーツは1881年、ルワーズ伯爵夫妻が漁師達をもてなしたビーチハウスに遡るという。1917年にホテル経営者のキンバル夫妻がビーチハウスを取得してホテルを開業。81年に三井不動産が取得。再開発が始まり、84年に現在の最高級ホテルとして開業した。今年は30周年に当たる。\n" +
            "*2009年から帝国ホテルと業務提携しており、帝国ホテルのサイトから宿泊予約できる。今期竜王戦七番勝負では第２局を「帝国ホテル 大阪」、第３局を「帝国ホテル 東京」で行う。同一系列のホテルで３局続けてタイトル戦が行われるのは初めて。\n" +
            "*【ハレクラニ】\n" +
            "*http://www.halekulani.com/jp/ \n" +
            "*【帝国ホテル】\n" +
            "*http://www.imperialhotel.co.jp/j/hawaii/halekulani/ \n" +
            "  21 ９六歩(97)   ( 0:00/00:00:00)\n" +
            "*ハワイは1795年にカメハメハ大王が統一し、ハワイ王国を建国した。\n" +
            "*そこからおよそ100年後の1898年にアメリカにハワイの主権が譲渡された。\n" +
            "*1959年に50番目の州となり、現在に至っている。日本で人気のリゾート地の一つとしてよく知られている。多少の温暖の差はあるが、常夏の気候で、12月でも軽装ですごすことができる。\n" +
            "  22 ９四歩(93)   ( 0:00/00:00:00)\n" +
            "  23 １六歩(17)   ( 0:00/00:00:00)\n" +
            "*対局室で撮影していた文記者によると、対局開始前に糸谷が微笑んでいたという。\n" +
            "*21年前、佐藤康光竜王と羽生善治名人で争った第６期竜王戦七番勝負でNHKの特集番組が組まれた。第６局の対局開始前後に羽生善治名人が微笑んでいるシーンがある。記者はその番組のことを思い出した。\n" +
            "*なお、第６期竜王戦第６局は羽生名人が勝ち。史上初の六冠王になった。竜王戦史上だけでなく、将棋史にも残る名局だ。\n" +
            "  24 １四歩(13)   ( 0:00/00:00:00)\n" +
            "  25 ３六歩(37)   ( 0:00/00:00:00)\n" +
            "*棒銀は▲２五歩から▲２七銀と進める。▲３六歩としたので腰掛け銀か早繰り銀になりそうだ。結果的に決勝トーナメントの▲糸谷－△行方尚史八段戦と似た将棋になった。▲糸谷－△行方戦は定跡形に戻った。\n" +
            "*【第２７期竜王戦決勝トーナメント行方尚史八段　対　糸谷哲郎六段】\n" +
            "*http://live.shogi.or.jp/ryuou/kifu/27/ryuou201408010201.html \n" +
            "  26 ５四銀(63)   ( 0:00/00:00:00)\n" +
            "*10時前、森内は腰掛け銀に構えた。\n" +
            "  27 ４六歩(47)   ( 0:00/00:00:00)\n" +
            "*糸谷はすぐに▲４六歩と突く。相腰掛け銀に進みそうだ。控室では関係者が『週刊将棋』の最新号を読んでいる。\n" +
            "*10時になり、おやつが出された。森内は午前のおやつはなし。糸谷はアイスティー。\n" +
            "*【対局は現地９時、日本時間４時開始】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-3717.html \n" +
            "  28 ５二金(61)   ( 0:00/00:00:00)\n" +
            "  29 ４七銀(38)   ( 0:00/00:00:00)\n" +
            "  30 ４二玉(51)   ( 0:00/00:00:00)\n" +
            "  31 ５六銀(47)   ( 0:00/00:00:00)\n" +
            "*結局相腰掛け銀へ。「後手の出方によっては早繰り銀もあったのですかね」と谷川九段。\n" +
            "*10時５分、糸谷が席を外す。しばらくして戻ってきた。\n" +
            "  32 ４四歩(43)   ( 0:00/00:00:00)\n" +
            "*先手の▲４五歩位取りを避ける。 \n" +
            "  33 ６六歩(67)   ( 0:00/00:00:00)\n" +
            "*△４四歩に▲６六歩は一つのタイミング。▲６六歩を早く指して不利になるわけではないが、６筋が争点になり△４四銀から△５五銀左と乱戦に持ち込んでくる指し方が生じる。\n" +
            "  34 ７四歩(73)   ( 0:00/00:00:00)\n" +
            "*モニターを見ていた谷川九段と佐藤九段が「すぐ指したがっていますね」「書き終わるのを待っているみたい」。\n" +
            "*谷川九段は「△７四歩は早かったですね。突かない指し方も多いですけど」と解説する。\n" +
            "  35 ３七桂(29)   ( 0:00/00:00:00)\n" +
            "  36 ３一玉(42)   ( 0:00/00:00:00)\n" +
            "*「実戦例が無茶苦茶増えたんじゃないですか」と佐藤康九段。調べて見ると、175局ヒットした。\n" +
            "  37 ４八飛(28)   ( 0:00/00:00:00)\n" +
            "  38 ４二金(52)   ( 0:00/00:00:00)\n" +
            "  39 ８八玉(79)   ( 0:00/00:00:00)\n" +
            "  40 ２二玉(31)   ( 0:00/00:00:00)\n" +
            "*よくある定跡形に。ここで▲２五桂とするのが昔からの定跡だった。\n" +
            "*しかし、第25期竜王戦七番勝負第１局の▲丸山忠久九段－△渡辺明竜王（当時）戦で後手が勝ってから減っていった。\n" +
            "*代わりに▲６八金右や▲１八香が指されている。\n" +
            "*【第25期竜王戦七番勝負第１局▲丸山忠久九段－△渡辺明竜王戦】\n" +
            "*http://live.shogi.or.jp/ryuou/kifu/25/ryuou201210150101.html \n" +
            "  41 ６八金(58)   ( 0:00/00:00:00)\n" +
            "*１分くらいで指されたので「早」と佐藤康九段が驚く。\n" +
            "  42 ２四銀(33)   ( 0:00/00:00:00)\n" +
            "*10時40分に指されて「封じ手大丈夫かなぁ」と佐藤康九段がつぶやく。▲６八金右も△２四銀も分岐点だが、すぐに指された。二人の予定の動きだったのだろう。ここまでの消費時間は▲糸谷27分、△森内51分。\n" +
            "*△２四銀は７月に豊島将之七段が指した手。糸谷も先手で１局経験しており（Ｂ級２組順位戦、対井上慶太九段戦）、そのときは▲２五歩△３三銀▲９八香△６五歩…から攻め合いに進んだ。先手は▲２五歩か▲４五歩が考えられる。前者は後手が△３五歩を狙っているので追い払う、後者は△２四銀で薄くなった４筋を攻めるものだ。\n" +
            "*糸谷が考えている間に佐藤康九段が同じ局面の棋譜を調べる。「うーん、難しいな。これはどういう意味なのでしょうか」と逆に記者へ尋ねる。８月の第55期王位戦第３局で野月七段が解説を務めていたことを知り「野月君に聞かないといけないな」とも。\n" +
            "  43 ２八飛(48)   ( 0:00/00:00:00)\n" +
            "*気合鋭く▲２八飛。初めて指された手だ。「ふふふふふ、研究が無駄になってしまいましたね」と佐藤康九段が苦笑する。ここで△３三銀▲２五歩と進めば、実戦例のある局面になる。佐藤康九段は「ひょえー」などと驚きながらデータベースを見て、棋譜を並べる。\n" +
            "*やがて、野月七段が控室へ。「あっ、野月君王位戦の将棋教えてよ」と佐藤康九段。「タイミングがどうだったか忘れましたが、▲２八飛みたいなこともやっていました」とのこと。11時20分過ぎ、「森内先生、１時間使われました」と石田四段が告げる。\n" +
            "*※局後の感想※\n" +
            "*「▲４五歩や▲２五歩もあるが、▲２八飛を指してみたかった」と糸谷。\n" +
            "  44 ３三銀(24)   ( 0:00/00:00:00)\n" +
            "  45 １八香(19)   ( 0:00/00:00:00)\n" +
            "*香上がりは部分的にあるが、この局面は初めて指された。控室では▲２五歩が予想されていた。「これは損得勘定が難しいですね」と佐藤康九段。\n" +
            "*▲１八香で▲２五歩なら10月５日放送のNHK杯▲木村一基八段－△森内戦に合流し、△７三桂から森内が勝っていた。糸谷はそれを踏まえた上での工夫か。佐藤康九段が△７三桂に▲４五歩を検討する。以下△同歩▲同桂△４四銀に▲７五歩△４五銀右▲同銀△同銀▲５五角△４四歩▲７四歩となれば先手十分。▲５五角の王手がポイントで、すぐ▲７四歩は△６五桂▲同歩△５五角が飛車取りと△７六桂を見て後手良しだ。後手は△４五銀右のところで△４六角など工夫できる。５五や４六などの角打ちは角換わり腰掛け銀の急所になる。\n" +
            "*控室に「祝第27期竜王戦」と文字の入ったチーズケーキやロールケーキが差し入れられた。「料理の鉄人」に出演経験があるシェフの後藤雅司さんの作品とのこと。\n" +
            "*対局室に入った小田尚英専門委員によると、糸谷が水を頼んだという。11時55分ごろ、森内は棋譜を借り、ここでの消費時間を尋ねる。石田四段はすぐ「19分使われました」と答えた。12時20分、糸谷が棋譜を借りる。森内が55分使ったところで昼食休憩になった。昼食は糸谷がクラブハウスサンドイッチ、本日のスープ（ターキーと野菜）、アイスコーヒー。森内はチーズバーガーとホットティー。ここまでの消費時間は▲糸谷１時間、△森内２時間４分。\n" +
            "*13時25分ごろ入室した糸谷、数分後にいったん席を外し、再開に間に合うよう戻った。森内は13時30分になっても現れない。13時35分過ぎに森内が戻ってきた。\n" +
            "  46 ４三金(42)   ( 0:00/00:00:00)\n" +
            "*森内は手待ちを続ける。対局室に入っていた谷川九段が戻り「△４三金直は61分でした」。将棋連盟会長に消費時間を教わることはめったにない。記者の背筋が伸びる。\n" +
            "*先手は飛車の動き、後手は左銀と右金の動きで手損している。2014年秋のパス合戦だ。先手は仕掛けがうまくいくパターンに持ち込みたいし、後手は攻められにくい形や隙あらば襲い掛かる形を考えている。\n" +
            "*■ニコニコ生放送■\n" +
            "*富岡英作八段＞本日の解説を務める富岡です。よろしくお願いします。森内竜王の鉄板流と呼ばれる受けと、早見えの天才・糸谷七段の攻めのぶつかり合いに注目したいです。後手は金を上がったり下がったりして様子を見ています。後手番なので隙ができなければ千日手にしても良いですし、隙ができればすかさず△６五歩▲同歩△７三桂と動いていくような手もあります。\n" +
            "*ponanzaの読み筋を見ることもできるんですね。▲４八飛△４二金引▲５八金△２四銀▲２八飛△４三金直▲２五歩△３三銀▲６八金右に△５九角を読んでいるんですか！　なるほど、▲２六角なら△９五歩▲同歩△６五歩▲同歩△７三桂▲６九金△７七角成に（１）▲同金なら△６五桂、（２）▲７七同桂なら△７五歩▲同歩△８六歩▲同歩△９五香▲同香△７六歩と行こうということですか。先手の▲２六角がボヤけているうちに攻めてしまおうということですね。私も角換わりをよく指すんですが、この△５九角には驚きました。\n" +
            "  47 ４八飛(28)   ( 0:00/00:00:00)\n" +
            "*先手は攻めをうかがう手待ち。後手は隙を作らないための手待ち。角換わり腰掛け銀における手待ち自体は、昭和30年代には似たような形が指されていた。その時代は先手の攻めがうまくいかず千日手に進んだため、角換わり腰掛け銀は廃れた。昭和60年代に入り、本局にも見られる▲２六歩型の腰掛け銀が登場したことで、後手の手待ち策を打ち破った。すると、後手は手待ちではなく先後同型にしたり、棒銀などで攻めを模索したりした。変遷を経て、ここ数年は後手が再び手待ち策を用いることが増えている。昭和30年代とは攻めの技術が上がったこと、角換わりでも穴熊を含みにする将棋が増えたことがあげられる。昔よりも複雑さが増したのだ。\n" +
            "*糸谷は△２四銀だと▲４五歩の当たりが強いとみているのだろう。佐藤康九段は△４二金引を予想する。「△４二金引とすれば、41手目の▲６八金右の局面で先手が▲１八香を指した上に、もう１手指せます。しかし、それで先手がいいのかといわれるとわかりません。もし△２四銀として▲２八飛なら…まずいですね。ふふふ」と笑う。\n" +
            "  48 ４二金(43)   ( 0:00/00:00:00)\n" +
            "*佐藤康九段の予想通り。角換わり腰掛け銀では△４二金型の矢倉が堅い。相矢倉だと弱点の３筋を攻められやすいためあまり見かけないが、角換わり腰掛け銀は４筋を攻める駒の配置なので多く指される構えだ。金の連結がいい。ここで▲４五歩は△同歩▲同銀△５九角でどうか。△５九角は▲６八金右型をとがめている。\n" +
            "*糸谷は背筋を伸ばして考えている。14時45分ごろ、糸谷は信玄袋からメガネふきを取り出して、メガネを丁寧にふく。\n" +
            "  49 ９八香(99)   ( 0:00/00:00:00)\n" +
            "*先手は飛車の動きで２手損、後手は左銀と右金で２手損ずつして計４手損。つまり、先手は２手得している。具体的には41手目▲６八金右の局面で、▲１八香と▲９八香の２手を多く指せた。\n" +
            "*佐藤康九段は今度△２四銀は（１）▲９九玉△３五歩▲２五歩△３六歩の変化に進んだときに、穴熊で遠い分だけ先手が得しそうという。「そういうことのための組み合わせですか。難しいな」と佐藤康九段。（２）▲２五歩△３三銀▲９九玉△６五歩の進展も42手目コメントで示した▲糸谷－△井上戦よりも先手玉が深く、遠い。\n" +
            "*15時になり、午後のおやつが出された。糸谷はハレクラニ特製のココナッツケーキとホットティー。森内はココナッツケーキとアイスティー。\n" +
            "*■ニコニコ生放送■\n" +
            "*富岡英作八段＞後手は△１二香から相穴熊にするか、もしくは△６五歩▲同歩△７三桂が成立するのか。後手はいまが一番良い形なので、成立するなら仕掛けたいところです。ここはかなり突っ込んで考えると思います。私の予想はその他の手です（笑）\n" +
            "  50 ３五歩(34)   ( 0:00/00:00:00)\n" +
            "*自玉側から動くのでリスクのある指し方だ。先手が▲１九香・▲９九香型なら、第55期王位戦七番勝負第６局▲木村一基八段－△羽生善治王位戦で指されていた。\n" +
            "*■ニコニコ生放送■\n" +
            "*富岡英作八段＞△３五歩は思い切った手です。こういうところは読んでもきりがないので、今までの経験が大事になってきます。▲４七銀と引くようでは元気が出ないですね。あがった銀ですから。\n" +
            "*※局後の感想※\n" +
            "*「（放っておくと）どんどん堅くなってしまいますからねぇ」と森内。ただ、王位戦の変化は後手が大変と感じていたようだ。\n" +
            "*「仕掛けが成立すると、▲１八香がひどい手になると思った」と糸谷。\n" +
            "  51 同　歩(36)   ( 0:00/00:00:00)\n" +
            "  52 ２四銀(33)   ( 0:00/00:00:00)\n" +
            "*△３五歩▲同歩△２四銀は25年ほど前から指されている、部分的な定跡。しかし、本局の組み合わせは初めてだ。従来の形から先手の香が一つずつ上がっているのが得か損か、それが本局のテーマだ。\n" +
            "*15時30分ごろから現地の大盤解説会は再開される。「王位戦の将棋を見せてください」と解説を担当する佐藤康九段。野月七段と観戦していたが、途中で時間切れ。解説会場へ向かった。\n" +
            "*手番の糸谷はおやつに手を伸ばす。\n" +
            "  53 ３四歩(35)   ( 0:00/00:00:00)\n" +
            "*15時35分過ぎ、糸谷は取られそうな歩を逃がす。後手が狙っていた△３五銀は歩を取り「ながら」銀が進出できる一挙両得の手。▲３四歩は「ながら」の手を許さない手筋だ。前述した類例の▲木村－△羽生戦は▲３四歩に△２七角▲４七銀△３五銀▲２八飛…と進んだ。手順中の▲４七銀で▲５八角とする変化もあり、吉田正和五段著『これからの角換わり』で触れられている。\n" +
            "  54 ２七角打     ( 0:00/00:00:00)\n" +
            "*類例の通りに角を打った。大盤解説の佐藤康九段と野月七段は▲４七銀が本命、対抗で▲５八角をあげた。佐藤康九段は2011年にハワイを訪れ、チャリティーイベントを開いたエピソードを披露。「多くの方に寄付をいただきました。1788ドル集まり、ありがたいと思いました。こちらは日本財団に寄付させていただきました」と話した。\n" +
            "*■ニコニコ生放送■\n" +
            "*富岡英作八段＞ひゃあ！　先手は次に△３六角成とされてはまずいので▲４七銀と引きます。△３五銀▲２八飛△２六銀▲２五桂△３七銀成▲２七飛△同成銀は先手が角を２枚持って手番です。そこで山口さん指摘の▲３六角は△３七成銀▲５四角△同歩▲７一角△８三飛▲４四角成△３三歩▲同歩成が一例ですが、この攻めは結構うるさいですよ。ponanzaの読みは現局面から▲４五歩△７五歩▲同歩△３六角成▲４六角△８四飛▲４四歩△２六馬▲２七歩ですか。いや私には絶対読めないです。▲２七歩なんて第一感「これで良くなるはずないでしょ」って手です。△２七同馬は▲２五歩△１三銀▲４五銀とぶつけるということですか。野獣のような攻めですね。ここまでしなくても、山口流の攻めで自然に良くなりそうな気がするんですけど。\n" +
            "  55 ４七銀(56)   ( 0:00/00:00:00)\n" +
            "*16時18分、糸谷は34分使って▲４七銀とした。ここまでの消費時間は▲糸谷２時間48分、△森内２時間58分。「（糸谷七段が）結構使っていますね」と谷川九段。局面について、「しばらくは類例の王位戦通りに進むのではないでしょうか。香がどう影響するかは先の話、特に▲９八香型は最後の方でしょう。個人的な意見ですが、王位戦では後に△４三金左として３四歩を取りに行きました。しかし、感触はよくない手なので、何かよくなる手があるのではと、その当時思いました」と解説する。\n" +
            "  56 ４三銀(54)   ( 0:00/00:00:00)\n" +
            "*時刻は16時40分になった。ここまでの消費時間は▲糸谷２時間48分、△森内３時間19分。\n" +
            "*小田専門委員が谷川九段に「▲４七銀に△４三銀はいかがですか」とたずねていた。▲４五歩でどうかといわれていたが、森内はその手を指した。６三に馬を作られると、後手陣が厚くなる。先手は▲４五歩が角道を止めながら攻める手で本筋といえる。\n" +
            "*「▲４五歩には△３四銀▲３六角△同角成▲同銀△３五歩▲４七銀△４五歩▲５五角という変化が考えられます。そこでどう後手が受けるか。途中で△７五歩と味をつける手もありますね。１筋から５筋が主戦場ですが、後手はどこかで先ほど言ったように△７五歩などとしたいですね。あそこで動かないと得をされると見て、動いたのかもしれません」と佐藤康九段。\n" +
            "  57 ４五歩(46)   ( 0:00/00:00:00)\n" +
            "*17時５分、糸谷は４筋を絡めて攻める。封じ手時刻まで１時間を切った。\n" +
            "*佐藤康九段は実戦さながらの険しい表情で考えている。\n" +
            "  58 ３四銀(43)   ( 0:00/00:00:00)\n" +
            "*17時15分過ぎの局面。谷川九段と佐藤康九段が検討している。（１）▲５五角△３六歩▲２五桂△３七歩成▲４四歩△４八と▲４三歩成と進めて「ちょっと無理ですかねぇ」と谷川九段。次いで△１二玉▲４二と△同飛▲３三歩△同桂▲同桂成△同銀▲３五歩と攻める。（２）▲３六角△同角成▲同銀△７五歩の展開も有力。先手は手が広く、このまま封じ手になるという予想も出ている。\n" +
            "*17時50分ごろ、谷川九段と佐藤康九段が対局室へ。18時を過ぎたが、糸谷は前傾姿勢で考え続けている。18時12分、糸谷が大きく息をついて座り直す。納得いくまで考えたいのだろう。18時25分、森内は席を外す。18時30分、糸谷が封じ手の意思表示をした。対局室近くに詰めていた取材陣が入室して撮影を始める。封じ手を記入して、糸谷が立会人の谷川九段に封筒を渡すときにパッと手渡してしまった。取材陣が撮影できるように手渡しているところで止めるのが慣例だ。もう一度、封じ手を渡すところをやり直した。先ほどまで大長考していたこともあり、フッと抜けてしまったのだろう。１日目の消費時間は▲糸谷４時間26分、△森内３時間30分。糸谷は１時間13分の長考で59手目を封じた。\n" +
            "*ちなみに、第16期十段戦七番勝負第７局▲加藤一二三棋王－△中原誠十段戦で加藤九段が封じ手の局面で大長考して19時に夕食休憩へ。20時対局再開からも考え、21時10分に３時間12分の長考で次の一手を封じた。その前例があり、竜王戦では１日目に夕食休憩はない。新聞解説の佐藤九段も同様の例がある。\n" +
            "*２日目朝、８時40分に糸谷が対局室へ。谷川九段に封じ手周辺について話を聞いていた。森内は８時47分ごろに着いた。石田四段による読み上げで１日目の指し手を再現していく。８時55分に並べ終えてしまった。封じ手開封は９時以降なので少し待つことになる。糸谷はグラスに氷を入れ、水をそそぐ。森内はお茶を飲んで気息を整える。８時59分、「それでは封じ手を開封します」と谷川九段。\n" +
            "*■ニコニコ生放送■\n" +
            "*富岡英作八段＞▲３六角とあわせて角を消しに行くのはありそうです。以下、△同角成▲同銀△３五歩▲４七銀△４五歩▲５五角△３三角▲６四角△９二飛▲２五歩△１三銀と進めば先手が良さそうです。Ponanzaの読みは▲３六歩ですか。△３五歩▲２八飛△４九角成にやはり▲５五角と打って、△３九馬に▲３八飛とぶつけるんですか！　人間では考えにくい手ですが、５五の角が大きく見えます。\n" +
            "*他には▲５八角という手があるんですか。△３五銀左▲２八飛△２六銀に▲３八銀が見えにくい手で、△３七銀成▲同銀△４五角成▲３六角△同馬▲同銀は先手の駒がさばけています。これも有力そうです。\n" +
            "*※局後の感想※\n" +
            "*「封じたんですけど、だいぶ直感と反する手を指したので…」と糸谷。\n" +
            "  59 ３六歩打     ( 0:00/00:00:00)\n" +
            "*谷川九段が「封じ手を開封します」と告げて封を開ける。「封じ手は▲３六歩です」の声に糸谷は滞空時間を取り、３六へ歩を打った。席に戻った谷川九段が「定刻になっていますので対局をお願いいたします」と宣言し、対局者は一礼した。\n" +
            "*佐藤九段は「一晩考えても当たらなかったな」と苦笑する。「▲３六歩はチラッと考えるくらいでした。△３五歩には▲５八角ですかね。なるほど、好手に見えます」とのこと。現地大盤解説での封じ手予想クイズで▲３六歩を的中させた方が一人いた。\n" +
            "*控室では佐藤康九段と控室を訪れた香川愛生女流王将が盤をはさむ。「香川先生教えてください」と佐藤康九段。「ここで唯一のタイトルホルダーですから」と谷川九段。△４五歩▲５五角△１二玉▲１五歩△同歩▲５六銀や△３八歩▲４四歩△１八角成が示される。９時31分、「森内竜王、４時間使われました」と石田四段。\n" +
            "*野月七段に話を聞いた。「封じ手予想は外れてすみませんとしか言いようがないですね。▲３六歩は指しにくい手です。局面は難解。△４五歩も△３八歩もどちらもありそう。先手は角を働かせないようにしながら決戦に持ち込みたいです。小技を使いながら５五など好所に角を打つ。逆に角が働くと▲３六歩はパスに近くなってしまいます」。\n" +
            "  60 ３五歩打     ( 0:00/00:00:00)\n" +
            "*９時45分ごろ、稲葉陽七段、大石直嗣六段、船江恒平五段、西川和宏五段、宮本広志四段が控室へ。14日に関西からハワイまで駆けつけていた。\n" +
            "*９時50分ごろ、野月七段、井道女流初段が大盤解説へ。\n" +
            "*※局後の感想※\n" +
            "*「△３八歩なら（１）▲同飛で大丈夫と思った」と糸谷。以下△３八同角成なら▲同銀△４五歩▲５五角が予定。森内は▲６一角△４三銀▲４四歩△５二銀▲同角成△同金▲４一銀の展開を嫌った。\n" +
            "  61 ２八飛(48)   ( 0:00/00:00:00)\n" +
            "*※局後の感想※\n" +
            "*糸谷は▲５八角は△３六歩▲同銀△同角成▲同角△３五銀左を嫌った。以下▲２五角なら△同銀▲同桂△３七角▲３八飛△２六角成▲３三歩△３一金でどうか。\n" +
            "  62 ４九角成(27) ( 0:00/00:00:00)\n" +
            "  63 ４四歩(45)   ( 0:00/00:00:00)\n" +
            "*控室では継ぎ盤が３つに増えた。佐藤康九段と香川女流王将の検討、稲葉七段と船江五段の検討、大石六段と西川和五段、宮本四段の検討。離れているが、３つ見えるところに谷川九段が座っている。\n" +
            "*▲４四歩で▲２五歩は△３三銀▲３五歩△同銀▲３六歩に△３九馬▲２七飛△４八馬と進んで面白くなかったようだ。\n" +
            "*ここで10時になり、２日目午前のおやつが出された。糸谷はアイスティー。森内はホットグリーンティー。グリーンティーはハーブとフルーツの香りがついており、日本の緑茶とは別物だ。\n" +
            "  64 ７五歩(74)   ( 0:00/00:00:00)\n" +
            "*▲６八金型の矢倉では７六が急所になる。６七金の普通の矢倉と違って、１枚分薄いからだ。▲同歩なら△３六歩や△９五歩、△３三銀といった手段で歩を取りにいって△７六歩を狙う。\n" +
            "*※局後の感想※\n" +
            "*糸谷は△９五歩なら手抜いて▲５五角と攻めるつもりだった。\n" +
            "  65 ９九玉(88)   ( 0:00/00:00:00)\n" +
            "*ノータイムで指された。ということは、このあたりまで封じ手のときに読んでいたのだろう。すごい読みだ。「隙あらば穴熊」が現代将棋の合言葉。しかし、もう中盤戦で攻められているところなのだ。所を攻められたときに冬眠しにいくとは、ちょっと思いつかない。ハワイで穴熊の冬眠というのも趣がある。森内は熟考に入った。\n" +
            "*青野九段に話を聞いた。「私なら▲６七角を考えるところでした。▲９九玉は遠さで勝負という考えです。△７五歩にも穴熊という感覚は現代の感性。もともとの穴熊なら堅いのはわかりますけど、こういう指し方や２枚でも堅いとかは昔の人だとちょっと指せないですね。先手は４四歩の取り込みが大きいです。急所に食い込んでいます。これをただで取られなければとみているのでしょう」。\n" +
            "*「取り込むのは損ですか」と観戦記者の青島さんがたずねると「無茶苦茶得ですよ」と佐藤康九段が笑った。といっても先手も▲８八銀と固められるので一利一害ある。継ぎ盤では△９五歩▲同歩△７六歩▲８八銀に△９六歩や△８六歩▲同歩△８五歩が示されている。後手は攻めるなら、穴熊の弱点である端にも味をつけたい。西川和五段は△３三銀と固めながら４四歩を取りに行く手を示す。\n" +
            "*10時25分、糸谷に続いて森内が席を外す。石田四段は立ち上がり、すそを直し、足を伸ばしながら外の景色を眺める。長い時間正座を続けているので、こういう機会に少しでも足を休めておきたい。稲葉七段、船江五段が大盤解説へ。\n" +
            "  66 ９五歩(94)   ( 0:00/00:00:00)\n" +
            "*10時45分、森内は42分の長考で攻める。ここまでの消費時間は▲糸谷４時間29分、△森内５時間７分。糸谷は２日目に入ってからまだ３分しか使っていない。森内は１時間30分以上使った。\n" +
            "*△７六歩▲８八銀の前に突き捨てておくのが筋。▲８八銀と引いたときに△９五歩だと、端が強くなってしまい、手抜かれる恐れがわずかでも生じるからだ。大石六段、西川和五段、宮本四段は▲９五同歩△７六歩▲８八銀△８六歩▲同歩△８五歩に▲５五角と打つ変化を調べている。相腰掛け銀では５五に角を打てないことが多い。ただし、本局では腰掛け銀が他のところへ出張しているため、先手は５六や５五に角を打てる。\n" +
            "  67 ５五角打     ( 0:00/00:00:00)\n" +
            "*△７六歩▲８八銀の交換がないため、端が薄いにもかかわらず、糸谷は手抜いて攻め合おうとしている。継ぎ盤に△３三銀にズイッと▲４六銀が示される。これは▲３五歩や▲２五桂から３筋にパンチを浴びる展開。後に△１二玉を佐藤康九段が示すが、「味が悪そうですね」と谷川九段。「わかりませんが、△７五歩の前に△９五歩とした方がよかったかもしれません」と佐藤康九段。\n" +
            "*※局後の感想※\n" +
            "*糸谷は▲９五同歩だと△７六歩▲８八銀△８六歩▲同歩△８五歩とされて指す気がしなかったという。\n" +
            "  68 ３三銀(24)   ( 0:00/00:00:00)\n" +
            "*控室では谷川九段、佐藤康九段、西川和五段、香川女流王将が「よーいドン！」とばかりに直線的な変化を調べた。すなわち、▲４六銀△３六歩▲４五桂△３七歩成▲３三桂成△同桂▲３五歩△同銀▲同銀△２八と▲６四角△９二飛▲３四歩△９六歩▲３三歩成△同金右▲２五桂△９七桂▲５三角成。ここまで進むと、先手に桂が入ると後手玉が詰んでしまうため後手がまずい。走り方のフォームを変えるか、障害物を置くか。何かしらの対策がいるようだ。\n" +
            "*糸谷の考慮中に11時30分を過ぎた。糸谷は前傾姿勢でグイッと顔を盤面に近づける。両者手を口元に当てて熟考している。ニコニコ生放送の中継のために稲葉七段、船江五段、香川女流王将が退室した。\n" +
            "  69 ３五歩(36)   ( 0:00/00:00:00)\n" +
            "*控室の面々が「あっ」と声を上げる。佐藤康九段が苦笑しながらうなだれた。「これ（▲４六銀）は当たると思ったんだけどなぁ」とぼやく。谷川九段も苦笑。\n" +
            "*※局後の感想※\n" +
            "*▲４六銀を示されて「▲３五歩しか見えなかったので。そうか」と糸谷。\n" +
            "  70 同　銀(34)   ( 0:00/00:00:00)\n" +
            "*糸谷は▲３五歩を指して席を外した。森内はすぐに、この一手の△３五同銀。\n" +
            "  71 ３四歩打     ( 0:00/00:00:00)\n" +
            "  72 ４四銀(33)   ( 0:00/00:00:00)\n" +
            "*「先手はシンプルに銀を取りに行こうとしていますね。▲６四角△９二飛に▲４五歩です。▲３五歩（69手目）では▲４六銀の変化も有力だったと思います。以下△３六歩▲４五桂△３七歩成▲３三桂成△同桂▲３五歩△同銀▲同銀△２八と▲６四角のときに△９二飛は負けそうだったので、△６七歩でどうだったか」と佐藤康九段。\n" +
            "  73 ６四角(55)   ( 0:00/00:00:00)\n" +
            "  74 ９二飛(82)   ( 0:00/00:00:00)\n" +
            "*先手は▲４五歩と打てば銀を取れる。しかし、後手も△６三歩で相打ち（▲７五角は△５五銀と逃げられてしまう）に持ち込める。\n" +
            "*【関西組合流】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-30e1.html \n" +
            "*【２日目の大盤解説会】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-795c.html \n" +
            "  75 ４五歩打     ( 0:00/00:00:00)\n" +
            "*11時45分ごろの局面。ここまでの消費時間は▲糸谷５時間６分、△森内５時間21分。ニコニコ生放送で現地から稲葉七段、船江五段、香川女流王将が出演している。\n" +
            "*△６三歩▲９一角成△同飛▲４四歩△同銀▲４六香△４三歩▲４四香△同歩▲２五桂△９六歩が直線的な進行。後手は△９七香と打ち込んで攻められる。こういうときに先手は△７六歩▲８八銀の交換を入れていないのが生きる。\n" +
            "*西川和五段にここまでの進行について聞いた。「全然検討している手が当たらないですね。▲３五歩（69手目）では▲４六銀が駒を使って自然で考えやすいですし、先手がやれそうだったのですが。糸谷さんとは10秒将棋とかで教わることもありますが、考えていない手が10秒将棋でもノータイムでビシビシ飛んできます。独特な棋風ですね」。65手目▲９九玉から▲５五角、▲３五歩の３手連続で検討に出なかった手が指された。\n" +
            "  76 ９六歩(95)   ( 0:00/00:00:00)\n" +
            "*検討していた△６三歩ではなかった。谷川九段が苦笑する。糸谷の考慮中に12時を過ぎた。（１）▲８八銀△３六歩や（２）▲９三歩△同飛▲４四歩△９七歩成▲同桂△９六歩▲８五桂とする稲葉七段流が示される。穴熊の桂が前に出る、個性的な手順だ。（３）▲４四歩△９七歩成▲同香は△９六歩▲同香△９八歩といった順で先手がまずいという。「香が前に行って取られてしまうのはまずいです。ですので、▲９三歩を利かして、▲９七同桂とする形でないといけません」と谷川九段。\n" +
            "*糸谷と同門の森信雄七段門下の大石六段に話を聞いた。「糸谷さんでしたら、▲８八銀とするかもしれません。攻めると見せて、受けに手を入れることも多いです。少し前の▲４四歩から▲９九玉は特徴的で、緩急自在な印象です。自陣に手を入れてバランスを取るのがうまい棋士ですね。後手は銀取りで忙しい局面ですが、△３六歩で陣形を和らげるように、手を戻すことはできるので長くなりそうです。森内竜王は４四銀が取られる前に一仕事しようとしています」。\n" +
            "*糸谷が36分使って12時30分になり、昼食休憩に入った。ここまでの消費時間は▲糸谷５時間42分、△森内５時間32分。昼食は糸谷がビーフカレーとロブスタービスク。森内はクラブハウスサンドイッチ。13時30分、対局再開。森内は戻っていない。\n" +
            "*■ニコニコ生放送■\n" +
            "*藤井猛九段＞２日目の解説を担当する藤井です。本日はよろしくお願いします。昼食休憩明けの手は銀を取る（▲４四歩）以外にあるんですか？▲８八銀？言われてみればそれもあるか。私は先手を持ちたいです。\n" +
            "*将棋はここからが一番おもしろいところ、第４コーナーをまわったあたりですね。ゴールまで一直線というところで、普通はテンションが上がるんですが、日本はまだ朝早い時間なんですよ。いやあ、ハワイ１回くらい行きたいなあ。\n" +
            "*【12時15分ごろの控室】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-e8f0.html \n" +
            "*【現地からの生放送】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-eec8.html \n" +
            "*【２日目昼食休憩】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-7583.html \n" +
            "  77 ４四歩(45)   ( 0:00/00:00:00)\n" +
            "*13時35分、森内が対局室へ戻ってきたころに糸谷は▲４四歩と指して、グラスに水をつぐ。平凡だが、控室の検討ではやりにくいと見られた銀取り。取るなら▲９三歩を利かすといわれていた。\n" +
            "*【２日目対局再開】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-cbd8.html \n" +
            "*※局後の感想※\n" +
            "*糸谷は▲９三歩△同飛▲４四歩だと、△９七歩成▲同桂△９六歩▲８五桂△９四飛▲７五角△４四飛▲４五歩△７四飛で銀得でも大変と見ていた。後手玉は堅く、先手陣にキズが多い。\n" +
            "  78 ９七歩成(96) ( 0:00/00:00:00)\n" +
            "  79 同　香(98)   ( 0:00/00:00:00)\n" +
            "*控室に戻ってきた谷川九段が「えっ？ そうなんだ」と小声で驚く。\n" +
            "  80 ９六歩打     ( 0:00/00:00:00)\n" +
            "  81 同　香(97)   ( 0:00/00:00:00)\n" +
            "*ここで単に△９六同飛なら▲９七歩でお帰りいただける。しかし、△９八歩がある。（１）▲同玉は△９七歩▲同桂△９六飛で先手は▲９七歩と打てないし、（２）▲８八玉も△９六飛▲９七歩△９四飛で角取りと△７六歩（銀が逃げられない）の両狙いになる。後手を持って検討している船江五段が△９四飛の局面で「これなら自信がある」という。\n" +
            "  82 ９八歩打     ( 0:00/00:00:00)\n" +
            "*76手目のコメントで先手まずいとされていた順に進んだ。糸谷はどう対処するのだろうか。\n" +
            "*※局後の感想※\n" +
            "*森内が△９六同飛を示すと、「△９八歩とばかり思っていた」と糸谷。△９六同飛は以下▲９七歩△９四飛▲２九飛（▲８二角成もある）△６七歩▲４九飛△６八歩成▲同銀が並べられた。\n" +
            "  83 ８八玉(99)   ( 0:00/00:00:00)\n" +
            "*▲９八同玉は△９七歩が痛い。▲８八玉は仕方ないが、せっかく戻った玉がはい出てしまった。これで先手はいいのだろうか。\n" +
            "*※局後の感想※\n" +
            "*玉がはいでたことについて「流れだったので仕方ない」と糸谷。\n" +
            "  84 ９六飛(92)   ( 0:00/00:00:00)\n" +
            "  85 ９七歩打     ( 0:00/00:00:00)\n" +
            "  86 ９四飛(96)   ( 0:00/00:00:00)\n" +
            "*ここ数手は一本道。△９四飛と引いたときに先手がどう指すか。「後手もやれると思います」と稲葉七段。\n" +
            "*糸谷は△７六歩を緩和させるために▲９九玉と引いたはずだが、当たりの強くなる▲８八玉型を強要されてしまった。\n" +
            "*■ニコニコ生放送■\n" +
            "*藤井猛九段＞私の封じ手予想は▲３六角でした。糸谷七段が▲３六歩を選んだのは、65手目の▲９九玉を指したいからだったのでしょう。指がしなったんじゃないですか？　しかし現局面、８八に玉がいると△７六歩に▲８八銀と引くことができません。\n" +
            "  87 ２九飛(28)   ( 0:00/00:00:00)\n" +
            "*馬をずらして働きを悪くさせようとしている。谷川九段、佐藤康九段、稲葉七段、大石六段、船江五段、西川和五段、宮本四段が△４八馬に▲４六銀（１）△６四飛▲３五銀△７六歩に▲３三銀△同桂▲同歩成△同金右▲３四歩というノーガードの打ち合いを検討している。そこでうまく寄せられれば、後手の勝ちだが、検討ではそれが見つかっていない。後手は▲４六銀に（２）△４四銀もある。ただし、▲９一角成△同飛▲４三歩△同金直▲４五歩にどうするか。14時13分、「森内先生残り２時間です」と石田四段。\n" +
            "*■ニコニコ生放送■\n" +
            "*藤井猛九段＞△６四飛▲４九飛の取り合いは▲４三歩成から▲５五角の王手飛車の筋が残るので後手はやりにくいですね。ここで△４八馬にどうするか。ponanzaは▲５八金を読んでいるんですか、なるほど。▲４六銀より▲５八金の方が冷静そうですね。\n" +
            "  88 ４八馬(49)   ( 0:00/00:00:00)\n" +
            "  89 ５八金(68)   ( 0:00/00:00:00)\n" +
            "*大盤解説会から青野九段が戻ってくる。控室で▲４六銀の変化を検討しているのを見て「▲５八金はないんですか。あちらでは▲５八金ばかり解説していたんです」。果たして、糸谷は▲５八金。馬を捕獲しているが、金が玉から離れてしまう。プラスばかりではない。\n" +
            "*ここで△６四飛▲４八金△７六歩なら▲４三歩成から▲５五角で王手飛車取りを狙う。△５八同馬▲同銀△７六歩▲同銀△６四飛も検討されている。\n" +
            "*【激しい変化あり】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-b815.html \n" +
            "  90 ４七馬(48)   ( 0:00/00:00:00)\n" +
            "*森内が取った駒は４七の銀だった。控室で予想されていなかった。\n" +
            "*※局後の感想※\n" +
            "*△５八同馬▲同銀△７六歩▲同銀△６四飛は▲４三歩成△９九角に▲７九玉と逃げられて、後手大変のようだ。\n" +
            "  91 同　金(58)   ( 0:00/00:00:00)\n" +
            "  92 ７六歩(75)   ( 0:00/00:00:00)\n" +
            "*控室で▲５八金に△４七馬でなく、△５八同馬を検討していた理由について「視覚的なことです」と苦笑する佐藤康九段。谷川九段は「後で△９九角と打ったときに金を持っている方が寄せやすいということですね」と解説する。\n" +
            "  93 同　銀(77)   ( 0:00/00:00:00)\n" +
            "*14時40分、糸谷は棋譜を見てから▲７六同銀と応じる。一直線ではないにしても、局面は少しずつ激しさを帯びてきた。先手陣には△３八角や△５八角のキズがある。そして、角は６四に落ちている。\n" +
            "*■ニコニコ生放送■\n" +
            "*藤井猛九段＞ざっと進めると△６四飛▲４三歩成△同金直▲５五角△４四歩▲６四角△３八角▲２五桂△２九角成▲３三銀△同桂▲同歩成△同金寄▲同桂成△同金▲２五桂。この時、先手玉は相当詰まない形なんですが、現局面から△７七歩▲同金とか▲同玉が入っていると得になる可能性もあるわけです。それを考えているんでしょうね。\n" +
            "  94 ６四飛(94)   ( 0:00/00:00:00)\n" +
            "  95 ４三歩成(44) ( 0:00/00:00:00)\n" +
            "*稲葉七段、船江五段の兄弟弟子は△４三同金直▲５五角△４四香▲６四角△４七香成▲２五桂の攻め合いを調べる。谷川九段、佐藤康九段の継ぎ盤は、後手を持つ佐藤康九段が険しい表情で熟考している。「なんだか、後手を持っていてあまり自信がなくなってきました」という。「▲２九飛（87手目）は勝負手気味で、途中で予定変更があったと思いますが、いまは難解です。▲９九玉と引いたときは穴熊でガンガン攻めるのかと思いましたが、いまの局面のように、少し乱れていてもバランスが取れている方が糸谷さんらしいです」とは稲葉七段。\n" +
            "*15時になり、２日目午後のおやつが出された。糸谷はビターチョコレートケーキ。森内はフルーツ盛り合わせ。ここまでの消費時間は▲糸谷５時間56分、△森内６時間25分。関係者によると、糸谷が「部屋が少し暑い」と話していたそうだ。エアコンの温度が特別高いわけではないが、難解な局面を前に熱を帯びてきているのだろう。モニターを見ると、氷水を飲む糸谷の姿が目立つ。森内は扇子も使わず、考えている。\n" +
            "*15時15分、控室で△９九角▲９八玉△６六角成が調べられている。そこで▲３二と△同金▲７七銀で攻めがあるかどうか。15時24分、森内は残り１時間を告げられた。\n" +
            "*【２日目午後のおやつ】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-4a35.html \n" +
            "  96 同　金(42)   ( 0:00/00:00:00)\n" +
            "*15時30分過ぎ、森内は△４三同金直と応じる。\n" +
            "*※局後の感想※\n" +
            "*「△４三同金左でしたか。後の▲３三香が見えているので」と森内。\n" +
            "*「それだと、▲５五角△４四香▲６四角△４七香成に▲４四歩△同銀▲４五歩を考えていました」と糸谷。\n" +
            "  97 ５五角打     ( 0:00/00:00:00)\n" +
            "*真ん中で気持ちよくかけた王手飛車。\n" +
            "*糸谷は羽織を脱いで考えている。\n" +
            "  98 ４四香打     ( 0:00/00:00:00)\n" +
            "*森内が席を立つ。糸谷はグラスに氷を入れ、水をそそいでから席を立った。石田四段が一人棋譜を書いている。\n" +
            "*▲６四角△４七香成▲２五桂で先手がやれるのではといわれている。先手からは▲９一角成が▲３三香を見るだけでなく、△５七成香から△５六角の詰めろ飛車取りに▲５五馬の王手を見た一挙両得の手になる。控室では、96手目にと金を取るなら△４三同金左を調べていた。これなら▲９一角成の後の▲３三香を緩和できた。糸谷は飛車を取るのが自然なところで腰を落として読みを入れている。\n" +
            "*■ニコニコ生放送■\n" +
            "*藤井猛九段＞Ponanzaは▲６四角△７七歩▲同玉△７三銀▲５五角△７五歩▲同銀△３八角を読んでいるんですか。こっちから逃げたいところに△７七歩と打ち、今度は▲５五角と逃げられ香車が走れなくなる。でもこういう目くらましみたいな手は嫌なものです。\n" +
            "  99 ６四角(55)   ( 0:00/00:00:00)\n" +
            " 100 ４七香成(44) ( 0:00/00:00:00)\n" +
            "*▲２五桂に（１）△９九歩成▲同玉△４五角を西川和五段、宮本四段が調べていたが、▲７九歩の底歩で届かないか。先手は２九飛が受けに利いており、遊び駒がない。（２）△７七歩▲同桂△４五角▲９一角成△９九銀▲７九玉△４六銀（詰めろ）を佐藤康九段、野月七段、稲葉七段が調べている。\n" +
            " 101 ９一角成(64) ( 0:00/00:00:00)\n" +
            "*「安全に勝とうということかな」と佐藤康九段がつぶやく。３七の桂馬を取られると、先手の攻撃力が落ちる。なので、▲２五桂を調べていた。\n" +
            "*【ハレクラニの客室】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-d426.html \n" +
            "*【海辺で撮影】\n" +
            "*http://kifulog.shogi.or.jp/ryuou/2014/10/post-1673.html \n" +
            " 102 ５七成香(47) ( 0:00/00:00:00)\n" +
            "*「あれっ、違った」と佐藤康九段。これなら▲２五桂と跳ねれば、先手がいけそうとされた変化に合流する。糸谷が手順を前後させたのは問題なかったことになる。\n" +
            "*16時10分、対局室で\n" +
            "*糸谷「この手は？」\n" +
            "*石田四段「３分です」\n" +
            "*糸谷「全体では？」\n" +
            "*石田四段「６時間28分です」\n" +
            "*と消費時間をたずねるやりとりがあった。糸谷が大きく息をつく。\n" +
            " 103 ９八玉(88)   ( 0:00/00:00:00)\n" +
            "*▲２五桂は△７三歩と止められるのを気にしたか。△７三歩は大石六段と西川和五段が検討していた。\n" +
            "*「▲２五桂に△７三歩は▲５五馬を消して、△５六角と打とうという手です。しかし、▲９二馬と引いて△４五角▲５六歩△１八角成▲３九飛と進めば先手がよさそうでした。糸谷さんはゼット（絶対に詰まない形）を作ってから攻めようとされているのだと思います」と大石六段と西川和五段が見解を述べてくれた。\n" +
            "*※局後の感想※\n" +
            "*「▲３三香では自信がなかった。▲９八玉で１手稼げると思った」と糸谷。\n" +
            " 104 ７七歩打     ( 0:00/00:00:00)\n" +
            "*筋。\n" +
            " 105 同　桂(89)   ( 0:00/00:00:00)\n" +
            "*現局面、駒の損得は飛車金交換で先手の駒得。右桂の働きで先手が勝る。▲２五桂から▲３三香となれば、大活躍だ。\n" +
            " 106 ４七角打     ( 0:00/00:00:00)\n" +
            "*局面は先手よしが佐藤康九段の見解。\n" +
            " 107 ７九飛(29)   ( 0:00/00:00:00)\n" +
            "*飛車を逃がすか、決めに出るか悩ましいところだった。糸谷はしばらく考えて飛車を逃がした。16時30分ごろの局面。残り時間は▲糸谷１時間22分、△森内41分。\n" +
            "*ここで有力なのは△５六角成。５六に角でなく馬を置くことで上部を厚くしているし、▲５五馬と引けない。△４七角は粘り強い手だった。ここで森内は残り40分を告げられた。\n" +
            "*△５六角成に▲３三香なら△６八金でどうか。「嫌なところもあるね」と青野九段。次の△７八金に▲同飛は△８九銀から詰まされてしまうため質駒補充ができない。\n" +
            " 108 ６八銀打     ( 0:00/00:00:00)\n" +
            "*いきなり打ち込んだ。▲３三香△７九銀不成▲３二香成△同玉▲７九金△４九飛▲８九金打△５六角成という順が検討されている。しかし、これは後手の飛車と馬が自陣に利いてきてしまう。\n" +
            "*16時54分、糸谷が「そっか、いやー。ひぇー」と声を上げる。\n" +
            "*※局後の感想※\n" +
            "*△５六角成▲３三香△６八金は▲３二香成△同玉▲８九金で「ゼット（絶対詰まない形）が作りやすいと思った」と糸谷。次いで△７九金▲同金引△７八歩▲同金直と応じて大丈夫だ。\n" +
            " 109 ３三香打     ( 0:00/00:00:00)\n" +
            "*糸谷は残り時間を聞いてから香を打ち込んだ。△３三同桂と取るか、△７九銀不成と取るか岐路だ。森内は残り20分を告げられた。時刻は17時を過ぎた。\n" +
            " 110 ７九銀(68)   ( 0:00/00:00:00)\n" +
            "*17時５分ごろの局面。残り時間は▲糸谷１時間12分、△森内20分。糸谷は棋譜をのぞきこむ。少しして、残り時間を石田四段にたずねる。\n" +
            "*これは△８八金からの詰めろ。先手はどこかで銀を取る必要がある。控室では▲３二香成△同玉▲７九金△４九飛▲８八銀にどうするかが調べられている。\n" +
            "*17時10分ごろ、佐藤康九段がティロフォンでニコニコ生放送に電話出演した。「糸谷さんが少しよさそうだけど、まだまだはっきりしないという感じです」と見解を伝える。17時15分、「いやー、そうか」と糸谷がぼやく。森内は前傾姿勢で考えている。\n" +
            " 111 同　金(78)   ( 0:00/00:00:00)\n" +
            " 112 ４九飛打     ( 0:00/00:00:00)\n" +
            "*谷川九段、佐藤康九段、船江五段、香川女流王将の継ぎ盤と稲葉七段、大石六段、西川和五段、宮本四段の継ぎ盤で検討されている。それは▲３二香成△同玉▲８八銀の順が並べられ、そこから動きが止まる。難しい局面のようだ。\n" +
            "*■ニコニコ生放送■\n" +
            "*藤井猛九段＞先手は▲８八銀と打つより▲３二香成△同玉▲８九金打とした方が堅いのでやりたくはあるんです。△５六角成とされても▲７八歩でしっかりした形です。しかしせっかく守りの金をはがしたのに、受けに使うというのも悩ましいです。\n" +
            " 113 ５九歩打     ( 0:00/00:00:00)\n" +
            "*「大駒は近づけて受けよ」。\n" +
            "*控室に戻ってきた青野九段は「あれっ、これは１手違うんじゃないかな。△６八銀と打ちましたよね。で、△７九銀不成▲同金△４九飛に仮に▲８八銀と受けたときに△７八歩と打っても、△７九歩成～△８九と～△８八ととしないと詰まないでしょ。だから後手は５手かけて先手玉を詰ますことになります。でも、▲７九飛に△５六角成～△６八金なら次に△７八金が詰めろだから４手で先手玉を詰ますことができました。本譜は△４九飛と攻防に打てるから一概に△５六角成がよかったとはいえませんけどね」という。\n" +
            " 114 同　飛成(49) ( 0:00/00:00:00)\n" +
            "*５筋に飛車を呼ぶことで、後の△５六角成としたときに、後手の飛車が自陣に利かないようにしている。しかし、ここで▲８八銀に△６八成香▲同金△８九金となると、△８八金▲同玉△６八竜からの詰めろ。▲５九歩が攻めを呼び込んでいる可能性もある。\n" +
            "*17時30分、糸谷がうめく。緊張が最高潮に達しつつあるようだ。形勢は先手が少しいいといわれている。糸谷も同じことを考え、逃せないと思えば、その分プレッシャーがかかる。17時33分、森内が目薬をさす。\n" +
            " 115 ３二香成(33) ( 0:00/00:00:00)\n" +
            " 116 同　玉(22)   ( 0:00/00:00:00)\n" +
            " 117 ８八銀打     ( 0:00/00:00:00)\n" +
            " 118 ５六角成(47) ( 0:00/00:00:00)\n" +
            "*※局後の感想※\n" +
            "*△９六歩は▲８二飛△４二歩▲８一飛成△９七歩成▲同玉と強く応じて先手いい。\n" +
            " 119 ８二飛打     ( 0:00/00:00:00)\n" +
            "*△４二歩▲８一飛成△８九金の詰めろに（１）▲６九桂の犠打を船江五段が示す。先手にもう１枚金か銀が入れば▲３一金からの詰めろになる。少しして、佐藤康九段は△８九金に（２）▲３一金△２二玉▲５五馬の鬼手を示す。△５五同馬と取らせれば、先手玉の詰めろが消えるので、そこで寄りがあれば先手が勝てる。「どちらかの筋で勝ちがありそうです。糸谷さんは読みきっているかもしれません」と佐藤康九段。\n" +
            "*■ニコニコ生放送■\n" +
            "*藤井猛九段＞節約して△４二歩と打つと▲８一飛成がぴったりです。４筋に歩を打ってしまうと自陣が強化しにくいですし、取った桂が最後の寄せに働いてきそうです。とはいえ△４二金打▲８一飛成△４一歩も２回受けるようでは少しつらいです。これは厳しそうですよ。▲８二飛は地味に厳しい攻めに見えます。\n" +
            " 120 ４二歩打     ( 0:00/00:00:00)\n" +
            "*17時45分、残り10分の森内は歩を受ける。\n" +
            " 121 ８一飛成(82) ( 0:00/00:00:00)\n" +
            " 122 ３四金(43)   ( 0:00/00:00:00)\n" +
            "*粘り強い。しかし、佐藤康九段は「▲５九歩がめちゃくちゃ利いていますね」。たしかに後手の飛車が４九なら４二まで利いていた。▲５九歩△同飛成の２手があるため、竜は先手陣にしか利かない。値千金の歩打ちだった。\n" +
            "*※局後の感想※\n" +
            "*△８九金の詰めろは119手目のコメントにもあるように、▲３一金△２二玉▲６九桂と犠打を打って先手勝てる。\n" +
            " 123 ３三歩打     ( 0:00/00:00:00)\n" +
            "*時刻は17時50分となった。104手目△７七歩と同様に手筋。△同桂は▲６五銀、△同金は▲４三歩が示されている。\n" +
            " 124 同　桂(21)   ( 0:00/00:00:00)\n" +
            "*森内が席を外す。\n" +
            "*17時55分、モニターから糸谷と石田四段による「残りは何分でしょうか」「43分です」「43分…」のやり取りが聞こえた。森内が席に戻ると、今度は糸谷が席を外した。糸谷が席に戻ると、石田四段は「残り40分です」と告げる。\n" +
            "*控室では青野九段が▲４三歩を示す。\n" +
            " 125 ２一銀打     ( 0:00/00:00:00)\n" +
            "*「えっ」と声が上がる。「これは浮かばないな」と佐藤康九段。▲４三歩に△同玉となるところ。それをあえて銀を打って４三へ追うことになる。\n" +
            " 126 ４三玉(32)   ( 0:00/00:00:00)\n" +
            " 127 ４一龍(81)   ( 0:00/00:00:00)\n" +
            "*「そうか、竜が引けるということか」と佐藤康九段。すなわち、△４四金で△３四玉の「中段玉寄せにくし」を狙うのは▲３二竜△３四玉▲２五金で詰んでいる。放っておくのも▲３二銀不成△５四玉▲６五金の筋で後手玉が詰んでしまう。\n" +
            "*ならば、先に△４四玉と早逃げするのはどうか。18時７分、森内は１分将棋に入った。森内は小さく体を揺らして読みを入れている。\n" +
            " 128 ４六銀(35)   ( 0:00/00:00:00)\n" +
            "*58秒まで読まれた森内はスッと３五の銀を４六へ滑らせた。糸谷は氷水を飲んで、あぐらに崩す。そして、席を立った。森内は上体を起こして盤面を見つめる。席に戻った糸谷は棋譜用紙を借りて、時間を確認した。そして、水を飲んで次の手を指した。\n" +
            "*▲３二銀不成△４四玉▲３六金が確実と稲葉七段。上下の挟撃形を築く寄せだ。なお、△４六銀で△４四玉は▲４二竜△４三金に▲同竜△同玉▲５五桂で寄りだった。\n" +
            " 129 ３二銀(21)   ( 0:00/00:00:00)\n" +
            " 130 ４四玉(43)   ( 0:00/00:00:00)\n" +
            "*検討は打ち切られ、関係者はモニターを見つめる。糸谷はしきりに水を飲む。\n" +
            " 131 ３六金打     ( 0:00/00:00:00)\n" +
            "*18時15分ごろ、糸谷はしっかりした手つきで金を打った。森内は左手で口を覆う。\n" +
            " 132 ８九金打     ( 0:00/00:00:00)\n" +
            "*△８八金▲同金△８九銀からの詰めろ。しかし、後手玉に詰みがある。森内は肩を落としているように見える。糸谷は水をゆっくり飲み、腕を組んで天を仰いでいる。\n" +
            " 133 ４二龍(41)   ( 0:00/00:00:00)\n" +
            "*ここで40秒を読まれた森内が投了した。投了以下は△５四玉▲４三銀不成△６三玉▲７五桂△７四玉▲７二竜△８四玉▲７三馬△９四玉▲８五銀△９三玉▲８二竜までの詰み。終局時刻は現地時間で17日18時19分（日本時間18日13時19分）。消費時間は▲糸谷７時間28分、△森内７時間59分。第２局は10月30・31日に大阪市「帝国ホテル 大阪」で行われる。\n" +
            "*■ニコニコ生放送■\n" +
            "*藤井猛九段＞一局を振り返って、途中▲４八飛とまわってまた▲２八飛と戻る手に感心しました。なかなか若者とは思えない癖のある指し方ですね。森内さんの用意してきた作戦に対して、巧妙に応じていました。そこからは先手が少し押し気味でしたが、形勢の針は何度か振れていたと思います。最後は気がつけば先手が良くなっていたという感じです。第２局は森内さんが角換わりの先手番で、糸谷七段を打ち破れるかどうかに注目ですね。\n" +
            "*※感想戦は19時13分ごろに終了した。\n" +
            "*感想戦では後手よしの変化は出てこなかった。難解ながら糸谷の工夫は成立しているようだ。43手目▲２八飛から▲１八香の手待ち作戦は今後の課題と言える。\n" +
            " 134 投了         ( 0:00/00:00:00)\n" +
            "まで133手で先手の勝ち\n";
    }
}
